
var dom = document.getElementById("jamIndexChange2");
var myChart = echarts.init(dom);
var app = {};
option = null;
option = {
    tooltip : {
        trigger: 'axis'
    },
    legend: {
        data:['今日拥堵指数','历史拥堵指数']
    },
    calculable : true,
    xAxis : [
        {
            type : 'category',
            boundaryGap: false,
            data : ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24']
        }
    ],
    yAxis : [
        {
            type : 'value'
        }
    ],
    series : [
        {
            name:'今日拥堵指数',
            type:'line',
            data:[0.3/30, 1.9/30, 0.3/30, 0.5/30, 10.0/30, 60.0/30, 218.0/30, 280.2/30, 185.6/30, 173.0/30, 121.4/30, 92.3/30,82.0/30, 74.9/30, 77.0/30, 98.2/30, 155.6/30, 220.7/30, 185.6/30, 142.2/30, 50.6/30, 30.0/30, 10.4/30, 3.3/30]
        },
        {
            name:'历史拥堵指数',
            type:'line',
            data:[3.0/30, 0.9/30, 0.8/30, 1.5/30, 13.0/30, 40.0/30, 110.0/30, 210.2/30, 160.6/30, 183.0/30, 131.4/30, 99.3/30,89.0/30, 70.9/30, 72.0/30, 90.2/30, 151.6/30, 209.7/30, 189.6/30, 153.2/30, 53.6/30, 35.0/30, 9.4/30, 4.3/30]
        }
    ]
};
;
if (option && typeof option === "object") {
    myChart.setOption(option, true);
}
